{
  "recipes": [
    {
      "recipeName": "Melting meatball macaroni",
      "ingredients": "300g pork mince\n400g beef mince (with around 10% fat)\n½ tsp fennel seeds\n½ tsp chilli flakes\n2 tsp dried oregano\n200g taleggio or mozzarella, chopped into small chunks\n2 tbsp olive oil\n1 large onion, finely chopped\n4 garlic cloves, crushed\n2 tsp tomato purée\n50ml red wine\n2 x 400g cans chopped tomatoes\n500ml passata\n3 bay leaves\n2 tsp golden caster sugar\n400g macaroni or other pasta shape\ncrusty bread, to serve (optional)",
      "description": "STEP 1\nHeat oven to 200C/180C fan/gas 6. Mix the pork and beef mince with the fennel seeds, chilli, 1 tsp oregano and some seasoning in a large bowl until combined. Divide and shape into 18 meatballs with a nugget or two of taleggio in the middle (save some for the top), then chill for 10 mins.\n\nSTEP 2\nHeat 1 tbsp oil in a large pan (use a flameproof casserole dish if you can – it’ll save on washing up). Add the onion and a pinch of salt and sizzle until softened (about 8 mins). Stir in the garlic and cook for 1 min more, then add the tomato purée, wine, tomatoes, passata, bay leaves, sugar, the remaining oregano and lots of seasoning, then cover with a lid and simmer for 20 mins. Meanwhile, arrange the meatballs on a baking tray lined with foil, drizzle with the remaining oil and bake for 10 mins.\n\nSTEP 3\nCook the pasta in a pan of boiling salted water according to packet instructions, then drain, reserving some water. If the pan isn't ovenproof, tip the sauce into a casserole dish. Stir the pasta into the sauce, along with the liquid from the meatballs and some pasta water if it needs thinning. Turn the grill to a medium-high setting.\n\nSTEP 4\nNestle the meatballs into the pasta, so that they poke out the top. Scatter the remaining taleggio over the top and grill for 5-10 mins until the cheese and meatballs are golden. Serve with crusty bread, if you like.",
      "id": "c1696b46-bb63-451e-a8b7-0fd606285b92"
    },
    {
      "recipeName": "Lionhead meatball soup",
      "ingredients": "100ml groundnut oil, for frying\nFor the meatballs\n500g lean pork mince\n4 garlic cloves, finely minced\n2 tbsp grated ginger\n2 spring onions, finely chopped\n1 pinch of ground white pepper\n50ml shaoxing rice wine or dry sherry\n1 tbsp dark soy sauce\n2 tbsp light soy sauce\n1 tbsp toasted sesame oil\n1 egg, beaten\n1 tbsp cornflour\nFor the soup broth\n500ml vegetable stock\n5 dried Chinese mushrooms slices\n200g Chinese leaf, washed, quartered lengthways from leaf to stem\n1 tbsp light soy sauce\n1 tbsp toasted sesame oil\n1 pinch of ground white pepper\n1 tbsp cornflour, mixed with 1 tbsp water\nTo serve\n2 large spring onions, washed, trimmed and sliced, to serve",
      "description": "STEP 1\nPut all the ingredients for the meatballs into a large bowl and stir to combine well. Using wetted hands, take a golf ball-sized mound and roll into a round shape. Put on a plate and repeat to make 12.\n\nSTEP 2\nPour the groundnut oil into a large wok or pan and set over high heat until a thermometer reads 160C. Put a meatball onto a slotted spoon and gently lower into the oil. Leave to brown for 5-7 mins until golden, then cook all the meatballs. To check if a meatball is cooked, push a skewer through and, if it comes out clean, it’s cooked. Lift the meatballs out, then drain on a plate lined with kitchen paper and set aside.\n\nSTEP 3\nAdd 1 tbsp of the hot oil to a clean wok. Put over a high heat, add the vegetable stock, 850ml water, the mushrooms and Chinese leaf, and cook over a medium heat for 10-12 mins. Add the meatballs and cook for a further 4-5 mins, adjusting the cabbage leaves so they wrap around each meatball – the meatball resembles the ‘lion's head’ and the cabbage resembles the ‘mane’. Season with sesame oil, salt and ground white pepper. To thicken the soup, add 1 tbsp of the cornflour mixture when the broth is boiling. Then turn the heat to low and garnish with the sliced spring onions.\n\nSTEP 4\nLadle a portion into soup bowls, spoon a meatball and with some Chinese leaf and sliced mushrooms, and serve immediately.",
      "id": "a23f0704-71d2-4a0d-a6a8-56adf6e23ff1"
    },
    {
      "recipeName": "Masala meatball curry",
      "ingredients": "2 garlic cloves\n1 red chilli, deseeded\n1 thick slice white bread\nsmall pack mint leaves, reserving some to serve\n400g lamb mince\n1 egg, lightly beaten\n1 tbsp vegetable oil\n1 large onion, roughly chopped\n1 tbsp masala curry paste\n400g can chopped tomato\n400ml lamb stock\n100g baby spinach leaves\ncooked basmati rice and cucumber & mint raita, to serve (optional)",
      "description": "STEP 1\nPlace the garlic, chilli, bread and mint in a food processor and pulse until finely chopped. Tip into a bowl and mix with the lamb, egg and seasoning. using damp hands, shape into 16 small meatballs.\n\nSTEP 2\nHeat half the vegetable oil in a large non-stick frying pan. Fry the meatballs in batches over a high heat until golden, then set aside.\n\nSTEP 3\nHeat the remaining oil in the frying pan, add the onion and cook for 3-4 mins until beginning to soften. Add the curry paste and fry for 1 min, then tip in the tomatoes and stock and bring to a simmer.\n\nSTEP 4\nAdd the meatballs and simmer for 15 mins until the sauce is thickened. Stir through the spinach until just wilted. Scatter over the reserved mint leaves, and serve with rice and cucumber & mint raita, if you like.",
      "id": "7283f78c-c799-4220-90a1-f10e63365777"
    },
    {
      "recipeName": "Malmö meatball subs",
      "ingredients": "1-2 tbsp sunflower oil, for frying\n2 tbsp white wine vinegar\n1 tbsp golden caster sugar\n⅓ cucumber, thinly sliced\n1 tbsp chopped dill (optional)\n4 sub rolls, halved, or 1 long, thin baguette, cut into 5cm chunks\njar cranberry sauce\nFor the meatballs\n300g pack pork mince\n50g breadcrumb\n1 tsp caraway or fennel seeds\n1 egg, beaten\n3 tbsp wholegrain mustard\n1 tbsp clear honey",
      "description": "STEP 1\nMix all the meatball ingredients together with plenty of seasoning, then shape into walnut-sized balls. Freeze for 30 mins to firm up if the party is about to start, or chill in the fridge for up to 24 hrs.\n\nSTEP 2\nHeat oven to 220C/200C fan/gas 7. Roll the meatballs in the oil in a baking tray, then roast for 20 mins until browned and cooked through.\n\nSTEP 3\nWhen the meatballs are nearly ready, mix the vinegar and sugar in a mixing bowl to dissolve, then stir in the cucumber and dill, if using.\n\nSTEP 4\nSplit the baguette chunks, rolls or subs and spread with a little cranberry sauce. Add some cucumber and 2-3 meatballs, arrange on a platter and serve.",
      "id": "b5ec97af-fb5c-4764-a8c9-1bbfce49c135"
    },
    {
      "recipeName": "Spanish meatball & butter bean stew",
      "ingredients": "350g lean pork mince\n2 tsp olive oil\n1 large red onion, chopped\n2 peppers, sliced, any colour will do\n3 garlic cloves, crushed\n1 tbsp sweet smoked paprika\n2 x 400g cans chopped tomatoes\n400g can butter beans, drained\n2 tsp golden caster sugar\nsmall bunch parsley, chopped\ncrusty bread, to serve (optional)",
      "description": "STEP 1\nSeason the pork, working the seasoning in with your hands, then shape into small meatballs. Heat the oil in a large pan, add the meatballs and cook for 5 mins, until golden brown all over. Push to one side of the pan and add the onion and peppers. Cook for a further 5 mins, stirring now and then, until the veg has softened, then stir in the garlic and paprika. Stir everything around in the pan for 1 min, then add the tomatoes. Cover with a lid and simmer for 10 mins.\n\nSTEP 2\nUncover, stir in the beans, the sugar and some seasoning, then simmer for a further 10 mins, uncovered. Just before serving, stir in the parsley. Serve with crusty bread for dunking, if you like.",
      "id": "68540692-4165-4d0b-a020-c3d7183cf6ed"
    },
    {
      "recipeName": "Spaghetti & meatballs",
      "ingredients": "8 good-quality pork sausages\n1 kg beef mince\n1 onion, finely chopped\n½ a large bunch flat-leaf parsley, finely chopped\n85g parmesan, grated, plus extra to serve (optional)\n100g fresh breadcrumbs\n2 eggs, beaten with a fork\nolive oil, for roasting\nspaghetti, to serve (about 100g per portion)\nFor the meatball sauce\n3 tbsp olive oil\n4 garlic cloves, crushed\n4 x 400g cans chopped tomatoes\n125ml red wine (optional)\n3 tbsp caster sugar\n½ a large bunch of flat-leaf parsley, finely chopped\nfew basil leaves (optional)",
      "description": "STEP 1\nFirst, make the meatballs. Split the skins of the sausages and squeeze out the meat into a large mixing bowl.\n\nSTEP 2\nAdd the mince, onion, parsley, parmesan, breadcrumbs, eggs and lots of seasoning. Get your hands in and mix together really well – the more you squeeze and mash the mince, the more tender the meatballs will be.\n\nSTEP 3\nHeat the oven to 220C/200C fan/gas 7. Roll the mince mixture into about 50 golf-ball-sized meatballs. Set aside any meatballs for freezing, allowing about five per portion, then spread the rest out in a large roasting tin – the meatballs will brown better if spaced out a bit.\n\nSTEP 4\nDrizzle with a little oil (about 1 tsp per portion), shake to coat, then roast for 20-30 mins until browned.\n\nSTEP 5\nMeanwhile, make the sauce. Heat the olive oil in a large saucepan. Add the garlic cloves and sizzle for 1 min.\n\nSTEP 6\nStir in the chopped tomatoes, red wine, if using, caster sugar, parsley and seasoning. Simmer for 15-20 mins until slightly thickened.\n\nSTEP 7\nStir in a few basil leaves, if using, spoon out any portions for freezing, then add the cooked meatballs to the pan to keep warm while you cook the spaghetti in a pan of boiling, salted water.\n\nSTEP 8\nSpoon the sauce and meatballs over spaghetti, or stir them all together and serve with extra parmesan and a few basil leaves, if you like.",
      "id": "c44f48e0-fef8-45c8-bc76-70f94e82b4e0"
    },
    {
      "recipeName": "Lemony lamb meatballs",
      "ingredients": "100g stale white bread, blitzed to crumbs\n100ml milk\n600g lamb mince\n2 fat lemons, zested\n2 garlic cloves, crushed\n1 tbsp ground cumin\n¼ tsp ground cloves\nsmall bunch coriander, stalks finely chopped and leaves picked\n2 tbsp olive oil\n250ml natural yogurt\n½ pomegranate, seeds removed",
      "description": "STEP 1\nPut the breadcrumbs in a bowl and add the milk. Leave for 5 mins, or until the milk has been absorbed. Add the lamb, lemon zest, garlic, spices, coriander stalks and plenty of seasoning. Mix everything well with your hands, then shape into meatballs, it should make about 30. Cover and chill the meatballs for at least 30 mins, or up to 24 hrs.\n\nSTEP 2\nHeat the oil in a large frying pan, or two smaller ones. Cook the meatballs for 8-10 mins, rolling them around the pan until nicely browned on all sides and cooked through. To serve, arrange the meatballs on a platter. If the yogurt is quite thick, add a drop of water or lemon juice. Drizzle it over the meatballs, then scatter the pomegranate seeds and coriander leaves on top.",
      "id": "599db2c3-5a7e-43e0-a024-6d0cd673e56f"
    },
    {
      "recipeName": "Meatballs with creamy mushrooms",
      "ingredients": "600g floury potatoes, such as Maris Piper or King Edwards\n50g butter\n50ml milk\n500g pork or turkey mince (10% fat)\n20g grated parmesan\n1 apple, peeled, cored and grated\n2 tbsp olive oil\n1 onion, chopped\n2 garlic cloves\n300g mushrooms, sliced\nsmall bunch of thyme, leaves picked\n200g half-fat crème fraîche\n300g peas or green beans",
      "description": "STEP 1\nCook the potatoes in a large pan of boiling water for 15 mins until tender. Drain, return to the pan, add the butter, milk and season, then mash until smooth. Keep warm until you’re ready to serve.\n\nSTEP 2\nMeanwhile, combine the mince, parmesan, grated apple and some seasoning. Shape the mixture into ping-pong-ball-sized meatballs. Heat half the oil in a wide pan over a medium heat. Fry the meatballs for a few minutes, stirring, until golden all over. Transfer to a plate.\n\nSTEP 3\nHeat the remaining oil in the pan, and fry the onion for 8-10 mins until soft and translucent. Add the garlic, mushrooms and thyme, then season and fry for 10 mins more until the mushrooms are soft and most of the liquid has evaporated. Stir in the crème fraîche.\n\nSTEP 4\nCook the peas or green beans in a pan of boiling water for a few minutes until tender. Drain and leave to steam-dry. Stir the meatballs through the sauce and cook for 1-2 mins until hot and cooked through, then season. If you want to make the meatballs ahead, leave to cool. Will keep chilled for up to a day. Reheat thoroughly. Serve alongside the mash and veg.",
      "id": "9ab4f706-677d-4a91-a679-c11668a0feb4"
    },
    {
      "recipeName": "Teriyaki pork meatballs",
      "ingredients": "250g dried medium egg noodles\n12 pork meatballs\n250g pak choi\n6 tbsp teriyaki sauce",
      "description": "STEP 1\nCook the noodles following pack instructions. Add 2 tbsp sunflower oil to a frying pan over a medium heat. Fry the meatballs for 3 mins or until golden brown all over. Lower the heat and cook for 6 mins more. Quarter the pak choi, raise the heat, add the pak choi and cook for 3 mins. Stir through the teriyaki sauce and toss everything together with the drained noodles. Divide between bowls and serve.",
      "id": "5f7a2967-5111-40d8-bd45-8c4133341358"
    }
  ]
}